//app.js
App({
  onLaunch: function () {
    // 展示本地存储能力
    var logs = wx.getStorageSync('logs') || []
    logs.unshift(Date.now())
    wx.setStorageSync('logs', logs)

    // 登录
    wx.login({
      success: res => {
        // 发送 res.code 到后台换取 openId, sessionKey, unionId
      }
    })
    // 获取用户信息
    wx.getSetting({
      success: res => {
        if (res.authSetting['scope.userInfo']) {
          // 已经授权，可以直接调用 getUserInfo 获取头像昵称，不会弹框
          wx.getUserInfo({
            success: res => {
              // 可以将 res 发送给后台解码出 unionId
              this.globalData.userInfo = res.userInfo
              // 由于 getUserInfo 是网络请求，可能会在 Page.onLoad 之后才返回
              // 所以此处加入 callback 以防止这种情况
              if (this.userInfoReadyCallback) {
                this.userInfoReadyCallback(res)
              }
            }
          })
        }
      }
    })
  },
  globalData: {
    userInfo: null,
    citys:['北京','长春','成都','重庆','长沙','大连','德阳','福州','广元','贵阳','广州','邯郸','哈尔滨','合肥','呼和浩特','海口','杭州','济南','昆明','拉萨','兰州','宁波','南昌','南京','南宁','青岛','日喀则','上海','石家庄','沈阳','苏州','深圳','泰安','天津','铜陵','太原','芜湖','武汉','乌鲁木齐','西安','厦门','西宁','咸阳','宜春','宜昌','银川','郑州'],
    city:'成都',
    guideInfo:[
      {
          title:'厨余垃圾',
          type:'A',
          bgc:'#c6e5d9',
          logo:'/images/guide/typeA.png',
          elplain:'是指易腐蚀的生物质废弃物。包括剩菜剩饭、瓜皮果核、花卉绿植、肉类碎骨、过期食品、餐厨垃圾等。',
          rtext:['纯流质的食物垃圾，如牛奶等，应直接倒入下水口','有包装的餐厨垃圾应将包装物去除后分类投放，包装物请投放到对应的可回收物容器或其他垃圾容器'],
          list:['CoCo的青稞','姑娘果','菇娘果','秸秆杯','秸秆碗','KFC圆筒冰淇淋','Mcake','QQ软糖','阿波罗火腿',"阿华田巧克力酱",
           "艾草", "鹌鹑", "鹌鹑蛋", "鹌鹑蛋壳", "奥尔良烤鸡", "奥尔良鸡翅", "奥利奥饼干", "奥利奥酸奶蛋糕", "澳梅", "澳洲牛肉",
           "艾叶", "宝宝辅食泥", "棒棒糖", "八宝粥", "菠菜", "包菜", "冰草", "白菜", "白茶", "白菜叶",
           "包菜叶子:", "白菜猪肉水饺", "布丁", "扁豆", "巴旦木", "冰粉", "贝果", "冰糕.", "饼干", "碧根果肉",
           "白瓜子", "饼干渣", "包裹着猫屎的豆腐猫砂", "百合", "冰火菠萝油", "薄荷糖", "薄荷叶", "八角", "北极贝", "北京烤鸭", "北极甜虾",
           "北极虾", "芭蕉叶", "壳肉", "菠萝", "槟榔.", "板栗", "菠萝包", "菠萝干", "板栗壳", "菠萝蜜", "菠萝蜜肉",
           "菠萝皮", "菠萝叶子", "拌面", "爆米花", "白米虾", "白米虾壳", "比目鱼片", "冰淇淋", "冰淇淋脆筒", "蚌肉", "半熟巧克力",
           "白砂糖", "半熟芝士蛋糕", "白色恋人饼干", "拔丝苹果", "拔丝香蕉", "白糖", "冰糖", "冰糖葫芦", "百香果", "百香果壳", "百香果籽",
           "冰鲜黄鱼", "爆鱼", "鲍鱼", "白玉卷", "鲍鱼肉", "鲅鱼水饺", "捕蝇诱饵", "包子", "白煮蛋壳", "煲仔饭",
           "白芝麻", "变质冷面", "变质米饭", "包子皮", "子馅", "草", "葱", "菜", "蚕宝宝", "炒板栗",
           "草本植物", "蚕豆", "蚕豆壳", "菜饭", "炒饭", "糍饭糕", "茨菇", "菜根", "菜梗", "菜根菜头", "菜梗菜叶",
           "臭干子", "虫", "菜花", "残花", "臭虫", "臭豆腐", "肠粉", "炒花生壳", "炒花生米", "翅尖",
           "蛋", "大饼", "蛋皮", "蛋白", "大白菜", "蛋白粉", "豆瓣酱", "大白兔奶糖", "多宝鱼骨头", "大葱", "蛋炒饭",
           "大蒜叶", "蛋筒", "蛋挞", "蛋挞皮", "大头虾", "动物废弃内脏", "动物内脏", "调味品", "动物尸体", "凋谢的鲜花",
           "饭", "馊饭", "方便面", "方便面面条", "飞饼皮", "饭菜", "饭菜渣", "法棍", "风干食品", "凤梨皮", "凤梨酥",
           "干果", "干锅鸡", "瓜果壳", "瓜果皮", "瓜果皮核", "干果仁", "瓜果蔬菜", "干桂圆壳", "干瓜子壳",
           "汉堡中的面包", "海草", "花菜", "花草", "花草茶渣", "红肠", "花茶渣", "红茶渣", "花草树叶", "黑豆"

          ]
      },
      {
          title:'其他垃圾',
          bgc:'#fff1b9',
          type:'B',
          logo:'/images/guide/typeB.png',
          elplain:'是指除有害垃圾、可回收物、厨余（餐厨）垃圾以外的其他生活废弃物。',
          rtext:['尽量沥干水分','难以辨识类别的生活垃圾投入其他垃圾容器内'],
          list:['1号电池','3D打印模型','3D眼睛','504胶水','504胶水废包装','5号电池','7号电池','A4执包装袋','CD','CoCo奶茶杯','DVD',
          "PE塑料袋", "PH试纸", "Pocky包装袋", "清凉油", "清凉油", "清凉油瓶", "塑料广告牌", "塑料棋盘", "陶瓷盆", "陶瓷洗脸盆",
          "A4包装纸袋", "艾草灰", "艾灸贴", "艾灸条", "艾灸渣", "按摩精油", "安全套包装袋", "安瓶", "安全套", "肮脏塑料袋", "笔",
          "cd", "茶袋", "茶碟贝", "菜饭盒", "厨房垃圾袋", "厨房纸", "唇青", "擦过鼻涕的餐巾纸", "擦过鼻涕的纸巾", "擦过菜+的抽纸", "餐盒",
          "超市塑料袋", "茶壶碎片", "尘土", "宠物尿垫", "宠物饲料包装袋", "唇釉", "茶叶包", "茶叶包装袋", "茶叶蛋料包", "蛏子", "抽纸塑料袋",
          "大骨棒", "蛋糕包装", "蛋糕包装袋", "蛋糕包装盒", "豆干包装袋", "蛋糕袋", "冻干粉面膜", "大骨(如:猪腿骨)", "蛋糕塑料包装袋", "大骨头", "蛋黄饼塑料包装盒",
          "芾子壳", "袋装咖啡外包装", "电子烟烟弹", "鹅毛", "耳塞", "耳屎", "儿童尿不湿", "耳线", "粉饼", "粉笔", "粉饼盒",
          "防霉防蛀片", "发膜罐", "废毛巾", "防霉片", "妇女卫生用品", "粉扑", "发泡网", "发卡", "发圈", "废弃餐巾纸", "废弃的毛巾",
          "护理垫", "坏了的碗", "海螺壳", "海螺壳", "荷兰猪毛", "海绵", "海绵垫", "海绵蛋", "海绵粉扑:", "护目镜", "海绵条",
          "假睫毛胶水", "酒精棉片", "酒精棉片包装袋", "酒精棉球", "酒精棉签", "寄居蟹", "旧镜子", "旧筷子", "旧口罩", "脚膜", "鸡毛",
          "绿箭口香糖", "连裤袜", "榴莲", "拉链.", "卤料包", "乐乐茶杯.", "榴莲果核", "榴莲果皮", "颜料盒", "榴莲核", "榴莲壳",
          "母乳皂", "猫砂", "面霜", "麻绳", "麦穗", "墨水笔", "摩丝罐", "棉绳", "毛刷", "磨砂育",
          "棉质浴帽", "木质搅拌棒", "木质麻绳", "木制鸟笼", "木制铅笔", "木质梳子", "棉质卫生巾", "泥巴", "尿布", "暖宝宝", "暖宝宝"
      ]
      },
      {
          title:'可回收物',
          bgc:'#aacfd0',
          type:'C',
          logo:'/images/guide/typeC.png',
          elplain:'是指事已回收和可循环再利用的废弃物。主要包括废玻璃、废金属、废塑料、废纸张、废织物等。',
          rtext:['轻投轻放','清洁干燥，避免污染','废纸尽量平整','立体包装请清空内容物，清洁后压扁投放','有尖锐边角的，应包裹后投放'],
          list:['84消毒液瓶','A3纸','A4纸','AD钙奶瓶','AD钙瓶','Armani包','保险柜','保险箱','CD塑料盒','Celine包','Chanel包',
          "金属碗", "旧电视遥控器", "KFC纸袋", "LED手电筒", "LV包", "MCM包", "MP3", "PET塑料瓶", "PS4", "PU革",
          "USB线", "U盘", "振动棒", "震动棒", "转运汽水瓶", "暗疮针", "按摩器", "安慕希酸奶盒", "奥特曼玩具", "安全帽",
          "奥特曼卡片", "布", "布", "包", "布包", "包包", "冰吧", "背包", "布笔袋",
          "八宝粥罐", "白炽灯", "杯垫", "布袋", "被单", "瘪掉的篮球", "布袋子", "报废车辆.", "饼干罐", "饼干盒子", "饼干铁盒",
          "裁纸刀", "传真机", "刀", "档案袋", "打包袋", "豆瓣酱玻璃瓶", "电脑机箱", "打包绳", "电冰箱", "单车", "电吹风",
          "电瓶", "吊牌", "刀片", "东鹏特饮塑料瓶", "电器", "电器产品", "氮气罐", "打气筒", "地球仪", "电容", "电容笔",
          "大衣", "电源插头", "电源插座护盖", "电熨斗", "打印过的废纸", "打印机", "打印机墨盒", "打印墨盒", "电源线", "打印纸", "钉子",
          "儿童乘坐物", "儿童电动玩具", "儿童玩具", "儿童游玩器具", "耳挖", "飞镖", "帆布包", "帆布袋", "废玻璃", "废玻璃制品", "帆布鞋",
          "废金属", "废旧书", "废旧手电筒", "废旧手机", "废旧塑料盒", "废旧泡沫塑料", "废旧收音机", "废旧台灯", "废旧玩具", "废旧小家电", "废旧吸铁石",
          "购物纸袋", "塑料拖鞋", "高压锅", "干衣机", "公仔", "挂钟", "工字钉", "果汁机", "工资卡", "海报",
          "坏空调器", "坏了的玩具", "红领巾", "坏垃圾桶", "呼啦圈", "花露水玻璃瓶", "花露水瓶", "花露水塑料瓶", "花露水瓶", "红牛罐",
          "旧窗帘", "即冲奶茶包装盒", "洁厕瓶", "酱菜瓶", "脚垫", "家电.", "剪刀", "鸡蛋包装盒", "鸡蛋盒", "机顶盒", "鸡蛋盒包装",
          "旧跑鞋", "旧皮鞋", "旧皮衣", "酒瓶子", "金器", "机器人", "金枪鱼罐头", "旧锁", "旧书包", "旧书本", "金属厨具",
          "可乐罐子", "刻录机", "科罗娜啤酒瓶", "可乐瓶", "可乐瓶瓶盖", "开瓶器", "空气净化器", "空气加湿器", "矿泉水瓶盖", "矿泉水瓶", "矿泉水桶",
          "溜冰鞋", "劳保鞋", "铝箔纸", "绿茶包装盒", "老抽瓶", "螺钉", "领带", "铃铛", "理发器", "兰芳园塑料奶茶瓶", "铝锅"
      ]
      },
      {
          title:'有害垃圾',
          bgc:'#fec8c9',
          type:'D',
          logo:'/images/guide/typeD.png',
          elplain:'是指对人体健康或者自然环境造成直接或者潜在危害的零星废弃物，单位集中生产的除外。主要包括废电池、废灯管、废药品、废油漆桶等。',
          rtext:['充电电池、纽扣电池、蓄电池投放时请注意轻放','油漆桶、杀虫剂如有残留物请密闭后投放','荧光灯、节能灯易破损请连带包装或包裹后轻放','废药品及其包装连带包装一并投放'],
          list:['502胶水','704粘合剂','704粘和剂','LED灯(含水银)','LED灯泡','驱虫药','万用表电池','X光片','氨基甲酸脂类除草剂','氨基甲酸酯类杀虫剂',
          '酰胺类除草剂','安神补脑片','安神补脑液','安神补脑液瓶','阿司匹林',"报废药品及过期原料", "笔记本电池", "笔记本电脑电池", "苯甲醇的废物", "保健品", 
          "保健品瓶子", "玻璃灯管", "板蓝根冲剂", "板蓝根的包装袋","补品药瓶", "冰染染料", "丙酮的废物", "丙烯醛的废物", "冰箱杀菌喷雾器", "丙烯酸树脂涂料", "不用的夫西地酸乳育", 
          "不用的红花油", "不用的金霉素眼有", "苯氧羧酸类除草剂", "包扎残余物","除草剂罐", "除臭香波", "充电池", "除草剂", "除垢剂", "冲印相片", "除渍剂", "除甲醛竹炭包", "传染性废物",
          "柴油", "敌百虫", "地板喷蜡", "电池", "电池板", "镀槽淤渣", "电灯泡", "电镀水处理污泥", "敌敌畏", "大豆异黄酮软胶囊", "东阿阿胶",
          "灯管灯泡", "冻干粉", "打火机燃料罐", "碘酒棉球", "碘酒瓶", "达克宁药有", "达克宁药有皮", "代脲类除草剂", "都梁滴丸", "底片",
          "动物试验残余物", "动物试验废物", "打印过的彩色相片纸", "打印过的胶片", "电影胶片", "打印机色带", "打印机硒鼓", "定影液", "滴眼液", "滴眼液瓶", "定妆喷雾",
          "废灯管", "废灯泡", "复方首乌补液", "废含汞温度计", "废含汞血压计", "复合维生素引", "废旧灯", "废旧灯管", "废旧灯泡", "废胶卷", "废节能灯",
          "废硫酸", "辅酶Q10胶囊", "防霉剂", "福美锌", "废镍镉电池", "樊诺新根多", "废农药", "废弃的锂电池.", "废弃灯泡", "废弃的喷漆瓶", "废弃的相片底片",
          "废药品", "废油漆", "废油漆桶", "酚渣", "粉状药品包装袋", "废直式日光灯管", "灌肠袋", "管道疏通剂瓶", "感光胶片", "感光原料", "废旧电池",
          "过期的医用酒精", "过期的正红花油", "过期的指甲油", "过期的止痛有", "过期感冒药", "过期胶囊药物", "过期西药", "过期药", "过期孕妇护肤品", "过期药片", "过期药品",
          "给药器", "含钡废物", "含多氨苯并二恶英废物", "多氨苯并呋喃类废物", "含腐殖酸水溶肥", "含汞5号电池", "含汞体温计", "含汞温度计", "含汞血压计", "含汞荧光灯管", "含溴化镍的废物",
          "甲基J醇的废弃物!", "胶卷底片", "甲基丁酮的废物", "甲基乙基酮的废弃物.", "甲基乙烯酮的废物", "聚酯类的废物.", "精馏釜残物", "金霉素眼肓", "金霉素眼药青", "胶囊", "节能灯",
          "口服胶原蛋白", "口服液", "口服液瓶", "口服液瓶盖", "口服液瓶子", "口服液吸管", "颗粒药", "颗粒药包装袋", "开塞露", "咳嗽糖浆", "咳嗽糖浆玻璃瓶",
          "糖醇钙镁", "碳粉盒", "涂料", "涂料桶", "透明塑料药瓶", "脱色过滤物", "烫伤育", "烫伤药", "碳性电池", "维C银翘片",
          "眩晕宁颗粒", "西药瓶", "相纸", "董香正气水", "药", "浴霸灯泡", "药包装", "一次性注射器", "药罐", "药育", "药有包装壳"
      ]
      },
  ]
  }
})